Config/InformationRegisters/СведенияОПрочихУслугахСтудентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПрочихУслугахСтудентам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготыСтудентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокВыпискиСФ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокВыпискиСФЗаУслуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Факультет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачислениеСтудентамЗаПрочиеУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НачисленияСтудентамЗаПрочиеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СведенияОПрочихУслугахСтудентам/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает студента в форме по данным переданного отбора.
//
&НаСервере
Процедура УстановитьСтудента()
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("Студент") Тогда
		
			ОтборСтудент = Параметры.Отбор.Студент;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборСтудент", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборСтудент", "КнопкаОткрытия", Ложь);
			
		КонецЕсли; 
		
		Если Параметры.Отбор.Свойство("Регистратор") Тогда
		
			ОтборРегистратор = Параметры.Отбор.Регистратор;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборРегистратор", "ТолькоПросмотр", Истина);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСтудента()

#КонецОбласти



#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСтудента();
	
	Элементы.Студент.Видимость = НЕ ЗначениеЗаполнено(ОтборСтудент);
	Элементы.Регистратор.Видимость = НЕ ЗначениеЗаполнено(ОтборРегистратор);
	Элементы.ГруппаОтборыПериод.Видимость = ЗначениеЗаполнено(НачалоНачисления) ИЛИ ЗначениеЗаполнено(ОкончаниеНачисления);
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтудентПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Студент", ОтборСтудент, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборСтудент));
	Элементы.Студент.Видимость = НЕ ЗначениеЗаполнено(ОтборСтудент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРегистраторПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Регистратор", ОтборРегистратор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборРегистратор));
	Элементы.Регистратор.Видимость = НЕ ЗначениеЗаполнено(ОтборРегистратор);
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервалДатДляПросмотра(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", НачалоНачисления, ОкончаниеНачисления);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВыбратьПериод_Выбор", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.НастройкаПериодаОтчета", ПараметрыФормы,,,,,ОписаниеОповещенияОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВыбратьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "НачалоНачисления", РезультатВыбора.НачалоПериода, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , ЗначениеЗаполнено(РезультатВыбора.НачалоПериода));
		НачалоНачисления = РезультатВыбора.НачалоПериода;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ОкончаниеНачисления", РезультатВыбора.КонецПериода, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , ЗначениеЗаполнено(РезультатВыбора.КонецПериода));
		ОкончаниеНачисления = РезультатВыбора.КонецПериода;
	КонецЕсли;
	
	Элементы.ГруппаОтборыПериод.Видимость = ЗначениеЗаполнено(НачалоНачисления) ИЛИ  ЗначениеЗаполнено(ОкончаниеНачисления);
	
КонецПроцедуры

#КонецОбласти
